{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "agentic",
    "1": "analysis",
    "2": "code",
    "3": "conversational",
    "4": "creative",
    "5": "factual",
    "6": "longform",
    "7": "math",
    "8": "planning",
    "9": "skip",
    "10": "structured_output"
  },
  "initializer_range": 0.02,
  "label2id": {
    "agentic": 0,
    "analysis": 1,
    "code": 2,
    "conversational": 3,
    "creative": 4,
    "factual": 5,
    "longform": 6,
    "math": 7,
    "planning": 8,
    "skip": 9,
    "structured_output": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
